Autodesk.Revit.DB.FilterNumericRuleEvaluator.Evaluate(System.Int32,System.Int32)
Derived classes should override this method to implement the desired test.
lhs:
A value from an element in the document.
rhs:
The user-supplied value against which values from the document are tested.
Returns:
True if lhs, rhs satisfy the condition implemented by this evaluator.
Since:
2011

Autodesk.Revit.DB.FilterNumericRuleEvaluator.Evaluate(System.Double,System.Double,System.Double)
Derived classes override this method to implement the test that determines
whether the two given double-precision values satisfy the desired condition or not.
Remarks:
The arguments may be thought of as the left and right operands of a
binary expression; for example, "a < b", "x >= 100", etc.  The left
operand comes from an element in the Revit document (e.g., the value
of a parameter.)  The right operand is supplied by the user when
creating the filter that contains the rule that uses this evaluator.
lhs:
A value from an element in the document.
rhs:
The user-supplied value against which values from the document are tested.
epsilon:
Defines the tolerance within which two values may be considered equal.
Returns:
True if the given arguments satisfy the condition, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for lhs is not finite
-or-
The given value for lhs is not a number
-or-
The given value for rhs is not finite
-or-
The given value for rhs is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Since:
2011

Autodesk.Revit.DB.FilterNumericRuleEvaluator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilterNumericRuleEvaluator
Base for all classes that compare numeric values from Revit to a user-supplied filter value.
Remarks:
A class derived from FilterNumericRuleEvaluator must handle both integer and double-precision types.
For double-precision comparisons, an epsilon value is given.  The evaluator class should use this
value in a manner appropriate to the comparison being implemented.
Since:
2011